
#ifndef LED_H
#define LED_H

#include "Type.h"

void LedInit(void);
void LedSet(u8 cmd);
/**********************************************函数定义***************************************************** 
* 函数名称: void LedSetModeFlicker(u8 count) 
* 输入参数: u8 count 
* 返回参数: void  
* 功    能: 设置状态灯闪烁  count闪烁几次  
* 作    者: by lhb_steven
* 日    期: 2016/3/17
************************************************************************************************************/ 
void LedSetModeFlicker(u8 count);
/**********************************************函数定义***************************************************** 
* 函数名称: void LedTimeService(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能: LED动画的服务函数  
* 作    者: by lhb_steven
* 日    期: 2016/3/16
************************************************************************************************************/ 
void LedTimeService(void);

#endif

